src/cf/src/Documents/ПоступлениеБезналичныхДенежныхСредств/ПоступлениеБезналичныхДенежныхСредств.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПоступлениеБезналичныхДенежныхСредств</name>
  <basedOn>Document.РеализацияТоваровУслуг</basedOn>
  <basedOn>Document.ПоступлениеТоваровУслуг</basedOn>
  <basedOn>Document.СписаниеБезналичныхДенежныхСредств</basedOn>
  <basedOn>Document.РасходныйКассовыйОрдер</basedOn>
  <basedOn>Document.НалоговаяНакладная</basedOn>
  <registerRecords>AccumulationRegister.ОплатыЧеками</registerRecords>
  <registerRecords>AccumulationRegister.ДвиженияПоКассе</registerRecords>
  <registerRecords>AccumulationRegister.ДвиженияДенежныхСредств</registerRecords>
  <registerRecords>AccumulationRegister.ДенежныеСредстваОрганизаций</registerRecords>
  <registerRecords>AccumulationRegister.ВзаиморасчётыСПокупателями</registerRecords>
  <registerRecords>AccumulationRegister.ВзаиморасчётыСКонтрагентамиПрочие</registerRecords>
  <registerRecords>AccumulationRegister.ВзаиморасчётыСПоставщиками</registerRecords>
  <registerRecords>AccumulationRegister.ВзаиморасчётыСПокупателямиНалоговый</registerRecords>
  <registerRecords>AccumulationRegister.ВзаиморасчётыСПоcтавщикамиНалоговый</registerRecords>
  <attributes>
    <name>БанковскийСчёт</name>
    <type>
      <types>CatalogRef.БанковскиеСчета</types>
    </type>
  </attributes>
  <attributes>
    <name>БанковскийСчётКонтрагента</name>
    <type>
      <types>CatalogRef.БанковскиеСчета</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВходящегоДокумента</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПроведенияБанком</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыСКонтрагентами</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПлатежа</name>
    <comment>Поле 22 &quot;Код&quot;</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИННПлательщика</name>
    <type>
      <types>DefinedType.NIF</types>
    </type>
  </attributes>
  <attributes>
    <name>ИННПолучателя</name>
    <type>
      <types>DefinedType.NIF</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>DefinedType.Комментарий</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>DefinedType.КонтрагентДенежныхДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>КПППлательщика</name>
    <type>
      <types>DefinedType.RC</types>
    </type>
  </attributes>
  <attributes>
    <name>КПППолучателя</name>
    <type>
      <types>DefinedType.RC</types>
    </type>
  </attributes>
  <attributes>
    <name>НазначениеПлатежа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерВходящегоДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроведеноБанком</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяДДС</name>
    <type>
      <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <type>
      <types>EnumRef.ХозяйственныеОперации</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>КассоваяСмена</name>
    <type>
      <types>DocumentRef.КассоваяСмена</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОплаты</name>
    <type>
      <types>CatalogRef.TypesDePayment</types>
    </type>
  </attributes>
  <attributes>
    <name>Плательщик</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Чек</name>
    <type>
      <types>CatalogRef.БанковскиеЧеки</types>
    </type>
  </attributes>
  <attributes>
    <name>Касса</name>
    <type>
      <types>CatalogRef.Кассы</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТЧОснования</name>
    <attributes>
      <name>Основание</name>
      <type>
        <types>DocumentRef.СписаниеБезналичныхДенежныхСредств</types>
        <types>DocumentRef.КорректировкаДолга</types>
        <types>DocumentRef.РасходныйКассовыйОрдер</types>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
        <types>DocumentRef.НалоговаяНакладная</types>
        <types>DocumentRef.ПоступлениеТоваровУслуг</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>CatalogRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>НесколькоСтавокНДС</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>РасшифровкаНДС</name>
      <type>
        <types>DefinedType.Комментарий</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/cf/src/InformationRegisters/НастройкиПользователей/НастройкиПользователей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкиПользователей</name>
  <resources>
    <name>Значение</name>
    <comment>(Общ)</comment>
    <type>
      <types>Characteristic.ВидыНастроекПользователей</types>
    </type>
  </resources>
  <dimensions>
    <name>Пользователь</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Настройка</name>
    <comment>(Общ)</comment>
    <type>
      <types>ChartOfCharacteristicTypesRef.ВидыНастроекПользователей</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/cf/src/AccumulationRegisters/ДенежныеСредстваОрганизаций/ДенежныеСредстваОрганизаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ДенежныеСредстваОрганизаций</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <resources>
    <name>СуммаУчет</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <resources>
    <name>СуммаВВалюте</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <attributes>
    <name>Накладная</name>
    <type>
      <types>DocumentRef.ПрочиеРасходы</types>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
      <types>DocumentRef.НалоговаяНакладная</types>
      <types>DocumentRef.ПоступлениеТоваровУслуг</types>
      <types>DocumentRef.НалоговаяНакладнаяПокупка</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументДвижения</name>
    <type>
      <types>DocumentRef.СписаниеБезналичныхДенежныхСредств</types>
      <types>DocumentRef.РасходныйКассовыйОрдер</types>
      <types>DocumentRef.ПоступлениеБезналичныхДенежныхСредств</types>
      <types>DocumentRef.ПриходныйКассовыйОрдер</types>
      <types>DocumentRef.НалоговаяНакладная</types>
      <types>DocumentRef.НалоговаяНакладнаяПокупка</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДвижения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
      <types>DocumentRef.НалоговаяНакладная</types>
      <types>DocumentRef.ПоступлениеТоваровУслуг</types>
      <types>DocumentRef.НалоговаяНакладнаяПокупка</types>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.БанковскиеСчета</types>
      <types>CatalogRef.Кассы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипДенежныхСредств</name>
    <type>
      <types>CatalogRef.TypesDePayment</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/cf/src/AccumulationRegisters/ДвиженияПоКассе/ДвиженияПоКассе.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ДвиженияПоКассе</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <dimensions>
    <name>ДокументПродажи</name>
    <type>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
      <types>DocumentRef.НалоговаяНакладная</types>
      <types>DocumentRef.ПоступлениеТоваровУслуг</types>
      <types>DocumentRef.НалоговаяНакладнаяПокупка</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КассоваяСмена</name>
    <type>
      <types>DocumentRef.КассоваяСмена</types>
    </type>
  </dimensions>
  <dimensions>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.БанковскиеСчета</types>
      <types>CatalogRef.Кассы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипДвижения</name>
    <type>
      <types>EnumRef.ТипыДвиженияДенежныхСредств</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипДенежныхСредств</name>
    <type>
      <types>CatalogRef.TypesDePayment</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипНоменклатуры</name>
    <type>
      <types>EnumRef.ТипыНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ХозяйственнаяОперация</name>
    <type>
      <types>EnumRef.ХозяйственныеОперации</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/cf/src/AccumulationRegisters/ВзаиморасчётыСПоставщиками/ВзаиморасчётыСПоставщиками.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВзаиморасчётыСПоставщиками</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <resources>
    <name>СуммаВВалюте</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыСКонтрагентами</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОбъектРасчётов</name>
    <type>
      <types>DocumentRef.СписаниеБезналичныхДенежныхСредств</types>
      <types>DocumentRef.КорректировкаДолга</types>
      <types>DocumentRef.РасходныйКассовыйОрдер</types>
      <types>DocumentRef.ПоступлениеБезналичныхДенежныхСредств</types>
      <types>DocumentRef.ПриходныйКассовыйОрдер</types>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
      <types>DocumentRef.ПоступлениеДополнительныхРасходов</types>
      <types>DocumentRef.ПоступлениеТоваровУслуг</types>
      <types>DocumentRef.НалоговаяНакладнаяПокупка</types>
      <types>DocumentRef.ПоступлениеИзПереработки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/cf/src/AccumulationRegisters/Убытки/Убытки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Убытки</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатьяДДС</name>
    <type>
      <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
    </type>
  </dimensions>
  <dimensions>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ХозяйственнаяОперация</name>
    <type>
      <types>EnumRef.ХозяйственныеОперации</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/cf/src/AccumulationRegisters/ОплатыЧеками/ОплатыЧеками.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОплатыЧеками</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <dimensions>
    <name>Чек</name>
    <type>
      <types>CatalogRef.БанковскиеЧеки</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/cf/src/AccumulationRegisters/ВзаиморасчётыСПокупателямиНалоговый/ВзаиморасчётыСПокупателямиНалоговый.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВзаиморасчётыСПокупателямиНалоговый</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.ВидыОперацийНалоговые</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументДвижения</name>
    <type>
      <types>DocumentRef.СписаниеБезналичныхДенежныхСредств</types>
      <types>DocumentRef.РасходныйКассовыйОрдер</types>
      <types>DocumentRef.ПоступлениеБезналичныхДенежныхСредств</types>
      <types>DocumentRef.ПриходныйКассовыйОрдер</types>
      <types>DocumentRef.ВозвратОтПокупателяНалоговый</types>
      <types>DocumentRef.НалоговаяНакладная</types>
      <types>DocumentRef.ВозвратПоставщикуНалоговый</types>
      <types>DocumentRef.НалоговаяНакладнаяПокупка</types>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОбъектРасчётов</name>
    <type>
      <types>DocumentRef.СписаниеБезналичныхДенежныхСредств</types>
      <types>DocumentRef.РасходныйКассовыйОрдер</types>
      <types>DocumentRef.ПоступлениеБезналичныхДенежныхСредств</types>
      <types>DocumentRef.ПриходныйКассовыйОрдер</types>
      <types>DocumentRef.ВозвратОтПокупателяНалоговый</types>
      <types>DocumentRef.НалоговаяНакладная</types>
      <types>DocumentRef.ВозвратПоставщикуНалоговый</types>
      <types>DocumentRef.НалоговаяНакладнаяПокупка</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/cf/src/Documents/ПоступлениеБезналичныхДенежныхСредств/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	РаботаСДокументами.ЗаполнитьРеквизитыПоУмолчанию(ЭтотОбъект);
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Или
		ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПоступлениеТоваровУслуг") Или
		ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.РасходныйКассовыйОрдер") Или 
		ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.СписаниеБезналичныхДенежныхСредств") Или 
		ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.НалоговаяНакладная") Тогда
		Организация = ДанныеЗаполнения.Организация;
		ДанныеОрганизации = ОбщегоНазначенияВызовСервера.ПолучитьДанныеОрганизации(Организация);
		БанковскийСчёт = ДанныеОрганизации.БанковскийСчёт;
		Контрагент = ДанныеЗаполнения.Контрагент;
		ДанныеКонтрагента = ОбщегоНазначенияВызовСервера.ПолучитьДанныеКонтрагента(Контрагент, Организация,, ТекущаяДатаСеанса());
		БанковскийСчётКонтрагента = ДанныеКонтрагента.БанковскийСчёт;
		Договор = ДанныеЗаполнения.Договор;
		Документы.ПоступлениеБезналичныхДенежныхСредств.УстановитьРеквизитыПлательщикаПолучателя(ЭтотОбъект);
		Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.РеализацияТоваровУслуг")
			Или ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.НалоговаяНакладная") Тогда
			ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПоступлениеОплатыОтКлиента;
		ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПоступлениеТоваровУслуг") Тогда
			ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВозвратДенежныхСредствОтПоставщика;			
		Иначе	
			ХозяйственнаяОперация = ОбщегоНазначенияВызовСервераПовтИсп.ПолучитьСоответствиеПревращенийХозяйственныхОпераций(ДанныеЗаполнения.ХозяйственнаяОперация);
		КонецЕсли;
		ТипОплаты = Справочники.TypesDePayment.VirementBanquaire;
		// Сумма - в валюте кассы или счёта (основание в другой валюте пересчитывается по курсам).
		РаботаСВалютами.ЗаполнитьВалютуПлатежа(ЭтотОбъект);
		Сумма = РаботаСВалютами.СуммаВВалютеПлатежа(ДанныеЗаполнения, ДанныеЗаполнения.Сумма, ЭтотОбъект);
		РаботаСДокументамиКлиентСервер.ДобавитьОснованиеВДенежныйДокумент(ЭтотОбъект, ДанныеЗаполнения);
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда 
		ДокЗаполнения = ДанныеЗаполнения.Документ;
		ТипОплаты = ?(ДанныеЗаполнения.Свойство("ТипОплаты"), ДанныеЗаполнения.ТипОплаты, Справочники.TypesDePayment.VirementBanquaire);
		Организация = ДокЗаполнения.Организация;
		ДанныеОрганизации = ОбщегоНазначенияВызовСервера.ПолучитьДанныеОрганизации(Организация);
		Если Не ЗначениеЗаполнено(БанковскийСчёт) Тогда 
			БанковскийСчёт = ДанныеОрганизации.БанковскийСчёт;
		КонецЕсли;
		Кассир = ПараметрыСеанса.ПараметрыПользователя.Сотрудник;
		Контрагент = ДокЗаполнения.Контрагент;
		ДанныеКонтрагента = ОбщегоНазначенияВызовСервера.ПолучитьДанныеКонтрагента(Контрагент, Организация,, ТекущаяДатаСеанса());
		БанковскийСчётКонтрагента = ДанныеКонтрагента.БанковскийСчёт;
		Договор = ДокЗаполнения.Договор;
		Документы.ПоступлениеБезналичныхДенежныхСредств.УстановитьРеквизитыПлательщикаПолучателя(ЭтотОбъект);
		Если ТипЗнч(ДокЗаполнения) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
			ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПоступлениеОплатыОтКлиента;
		ИначеЕсли ТипЗнч(ДокЗаполнения) = Тип("ДокументСсылка.ПоступлениеТоваровУслуг") Тогда	
			ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВозвратДенежныхСредствОтПоставщика;	
		Иначе	
			ХозяйственнаяОперация = ОбщегоНазначенияВызовСервераПовтИсп.ПолучитьСоответствиеПревращенийХозяйственныхОпераций(ДокЗаполнения.ХозяйственнаяОперация);			
		КонецЕсли;
		Сумма = ДанныеЗаполнения.Сумма;
		РаботаСДокументамиКлиентСервер.ДобавитьОснованиеВДенежныйДокумент(ЭтотОбъект, ДокЗаполнения);
		Если Не ТЧОснования.Количество() = 0 Тогда 
			СтрТЧОснования = ТЧОснования.Получить(0);
			СтрТЧОснования.Сумма = Сумма;
			РаботаСДокументамиКлиентСервер.РассчитатьСуммуНДСПлатёжногоДокумента(СтрТЧОснования);
		КонецЕсли;
	Иначе
		ДанныеОрганизации = ОбщегоНазначенияВызовСервера.ПолучитьДанныеОрганизации(Организация);
		МестоХранения = РегистрыСведений.НастройкиПользователей.СкладПользователя();
	КонецЕсли;
	СтатьяДДС = ОбщегоНазначенияВызовСервера.ПолучитьСтатьюДДСПоХозяйственнойОперации(ХозяйственнаяОперация);
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	УстановитьПривилегированныйРежим(Истина);
	РаботаСДокументами.УстановитьЗаписьВсехРегистров(Движения);
	// Курсовые разницы строк оплаты копят регистры взаиморасчётов, пишет регистр Убытки после них.
	ДополнительныеСвойства.Вставить("КурсовыеРазницы", 0);
	ДополнительныеСвойства.Вставить("ЗакрытоСтрокамиОплаты", Новый Соответствие);
	// Блокировки
	Блокировка = Новый БлокировкаДанных;
	ЗаполнитьБлокировкуПроведения(Блокировка);
	Блокировка.Заблокировать();
	// Формируем движения
	РегистрыНакопления.ДенежныеСредстваОрганизаций.СформироватьДвижения(ЭтотОбъект);
	РегистрыНакопления.ДвиженияПоКассе.СформироватьДвижения(ЭтотОбъект);
	//РегистрыНакопления.ВзаиморасчётыСКонтрагентамиПрочие.СформироватьДвижения(ЭтотОбъект);
	РегистрыНакопления.ВзаиморасчётыСПокупателями.СформироватьДвижения(ЭтотОбъект);
	РегистрыНакопления.ВзаиморасчётыСПоставщиками.СформироватьДвижения(ЭтотОбъект);
	РегистрыНакопления.Убытки.СформироватьДвижения(ЭтотОбъект);
	РегистрыНакопления.ОплатыЧеками.СформироватьДвижения(ЭтотОбъект);
	РегистрыНакопления.ВзаиморасчётыСПокупателямиНалоговый.СформироватьДвижения(ЭтотОбъект);
	РегистрыНакопления.ВзаиморасчётыСПоcтавщикамиНалоговый.СформироватьДвижения(ЭтотОбъект);
	// Записываем движения
	Движения.Записать();
	ПроизводственныеЗаказы.ОбновитьСтадииПослеПроведения(ЭтотОбъект);
КонецПроцедуры

// Отмена проведения документа, затронувшего заказы клиента на производство: блокировки в порядке проведения,
// очистка движений и пересчёт стадий заказов (E8). Без таких заказов движения удаляет платформа, как раньше.
//
// Параметры:
//  Отказ - Булево - не используется.
//
Процедура ОбработкаУдаленияПроведения(Отказ)
	Блокировка = Новый БлокировкаДанных;
	ЗаполнитьБлокировкуПроведения(Блокировка);
	ПроизводственныеЗаказы.ОтменитьПроведениеДокумента(ЭтотОбъект, Блокировка);
КонецПроцедуры

// Блокировки проведения и отмены проведения - один набор в одном порядке (E8).
//
// Параметры:
//  Блокировка - БлокировкаДанных - заполняемая блокировка.
//
Процедура ЗаполнитьБлокировкуПроведения(Блокировка)
	Если ЗначениеЗаполнено(Контрагент) и ТипЗнч(Контрагент) = Тип("СправочникСсылка.Контрагенты") Тогда
		//УправляемыеБлокировки.ВзаиморасчётыСКонтрагентамиПрочее(Блокировка, Контрагент);
		УправляемыеБлокировки.ВзаиморасчётыСПокупателями(Блокировка, Контрагент);
		УправляемыеБлокировки.ВзаиморасчётыСПоставщиками(Блокировка, Контрагент);
	КонецЕсли;
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	// Курс копии - на её дату (РаботаСВалютами.ПроверитьВалютуПлатежа).
	КурсВалюты = 0;
	НомерВходящегоДокумента = "";
	ДатаВходящегоДокумента = Неопределено;
	ДатаПроведенияБанком = Неопределено;
	ПроведеноБанком = Ложь;
	Ответственный = ПараметрыСеанса.Пользователь;
	КассоваяСмена = Документы.КассоваяСмена.ПустаяСсылка();
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	РаботаСДокументами.МожноРедактироватьДокумент(ЭтотОбъект, Отказ);
	// Валюта - валюта кассы или счёта (docs/plans/multicurrency-payments.md).
	РаботаСВалютами.ПроверитьВалютуПлатежа(ЭтотОбъект, РежимЗаписи, Отказ);
	Если Не Отказ Тогда
		ПроизводственныеЗаказы.ЗапомнитьЗаказыДокумента(ЭтотОбъект, РежимЗаписи);
	КонецЕсли;
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	// Проведённый документ, перезаписанный без перепроведения, пересчитывает стадии своих заказов (E8).
	ПроизводственныеЗаказы.ОбновитьСтадииПриЗаписи(ЭтотОбъект);
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Если ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ОбналичиваниеЧека Тогда 
		ПроверяемыеРеквизиты.Добавить("Чек");
		ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("Контрагент"));
	КонецЕсли;
	Если ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.Инкассация Тогда 
		ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("Контрагент"));
		ПроверяемыеРеквизиты.Добавить("Касса");
	КонецЕсли;
КонецПроцедуры
